{
  "format": "layers-model",
  "generatedBy": "keras v3",
  "convertedBy": "simcap-export",
  "modelTopology": {
    "module": "keras.src.models.functional",
    "class_name": "Functional",
    "config": {
      "name": "finger_classifier",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_shape": [
              null,
              6
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer_2",
            "optional": false
          },
          "registered_name": null,
          "name": "input_layer_2",
          "inbound_nodes": []
        },
        {
          "module": "keras.src.models.functional",
          "class_name": "Functional",
          "config": {
            "name": "encoder",
            "trainable": true,
            "layers": [
              {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                  "batch_shape": [
                    null,
                    6
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "input_layer",
                  "optional": false
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
              },
              {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "units": 64,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null,
                  "quantization_config": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    6
                  ]
                },
                "name": "dense",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            6
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "input_layer",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "batch_normalization",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.99,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    64
                  ]
                },
                "name": "batch_normalization",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            64
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "dense",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "units": 48,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null,
                  "quantization_config": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    64
                  ]
                },
                "name": "dense_1",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            64
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "batch_normalization",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "batch_normalization_1",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.99,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    48
                  ]
                },
                "name": "batch_normalization_1",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            48
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "dense_1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                  "name": "dense_2",
                  "trainable": true,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "units": 32,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null,
                  "quantization_config": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    48
                  ]
                },
                "name": "dense_2",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            48
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "batch_normalization_1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              }
            ],
            "input_layers": [
              "input_layer",
              0,
              0
            ],
            "output_layers": [
              "dense_2",
              0,
              0
            ]
          },
          "registered_name": "Functional",
          "build_config": {
            "input_shape": null
          },
          "compile_config": {},
          "name": "encoder",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      6
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "input_layer_2",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "thumb_hidden",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "thumb_hidden",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "encoder",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "index_hidden",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "index_hidden",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "encoder",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "middle_hidden",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "middle_hidden",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "encoder",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "ring_hidden",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "ring_hidden",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "encoder",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "pinky_hidden",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "pinky_hidden",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "encoder",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "thumb_output",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              16
            ]
          },
          "name": "thumb_output",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      16
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "thumb_hidden",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "index_output",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              16
            ]
          },
          "name": "index_output",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      16
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "index_hidden",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "middle_output",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              16
            ]
          },
          "name": "middle_output",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      16
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "middle_hidden",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "ring_output",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              16
            ]
          },
          "name": "ring_output",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      16
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "ring_hidden",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "pinky_output",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              16
            ]
          },
          "name": "pinky_output",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      16
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "pinky_hidden",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        }
      ],
      "input_layers": [
        "input_layer_2",
        0,
        0
      ],
      "output_layers": [
        [
          "thumb_output",
          0,
          0
        ],
        [
          "index_output",
          0,
          0
        ],
        [
          "middle_output",
          0,
          0
        ],
        [
          "ring_output",
          0,
          0
        ],
        [
          "pinky_output",
          0,
          0
        ]
      ]
    },
    "registered_name": "Functional",
    "build_config": {
      "input_shape": null
    },
    "compile_config": {
      "optimizer": {
        "module": "keras.optimizers",
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        },
        "registered_name": null
      },
      "loss": "sparse_categorical_crossentropy",
      "loss_weights": null,
      "metrics": null,
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "encoder/kernel:0",
          "shape": [
            6,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            64,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            48,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "encoder/bias:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "thumb_hidden/kernel:0",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "thumb_hidden/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "index_hidden/kernel:0",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "index_hidden/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "middle_hidden/kernel:0",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "middle_hidden/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "ring_hidden/kernel:0",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "ring_hidden/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "pinky_hidden/kernel:0",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "pinky_hidden/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "thumb_output/kernel:0",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "thumb_output/bias:0",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "index_output/kernel:0",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "index_output/bias:0",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "middle_output/kernel:0",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "middle_output/bias:0",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "ring_output/kernel:0",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "ring_output/bias:0",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "pinky_output/kernel:0",
          "shape": [
            16,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "pinky_output/bias:0",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}