{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"mag_input": {"name": "mag_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mag_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/Relu", "op": "_FusedMatMul", "input": ["mag_input", "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "3"}]}, {"dim": [{"size": "3"}, {"size": "64"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/add_1", "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "64"}]}, {"dim": [{"size": "64"}, {"size": "48"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/mul_1", "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/add_1", "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "48"}]}, {"dim": [{"size": "48"}, {"size": "32"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "16"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "16"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "16"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "16"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "16"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}]}, {"dim": [{"size": "16"}, {"size": "2"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}]}, {"dim": [{"size": "16"}, {"size": "2"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}]}, {"dim": [{"size": "16"}, {"size": "2"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}]}, {"dim": [{"size": "16"}, {"size": "2"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/Relu", "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}]}, {"dim": [{"size": "16"}, {"size": "2"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_4", "op": "Identity", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_hidden_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/Cast/ReadVariableOp", "shape": [16, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/thumb_output_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_hidden_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/Cast/ReadVariableOp", "shape": [16, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/index_output_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_hidden_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/Cast/ReadVariableOp", "shape": [16, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/middle_output_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_hidden_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/Cast/ReadVariableOp", "shape": [16, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/ring_output_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/Cast/ReadVariableOp", "shape": [3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense1_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn1_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/Cast/ReadVariableOp", "shape": [64, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense2_1/BiasAdd/ReadVariableOp", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/mul", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_bn2_1/batchnorm/sub", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/Cast/ReadVariableOp", "shape": [48, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/enc_dense3_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_hidden_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/Cast/ReadVariableOp", "shape": [16, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/finger_classifier_v2_1/pinky_output_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}