{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js manual export",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Functional",
    "config": {
      "name": "functional",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_shape": [
              null,
              10,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer",
            "optional": false
          },
          "registered_name": null,
          "name": "input_layer",
          "inbound_nodes": []
        },
        {
          "module": "keras.layers",
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "filters": 32,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              10,
              3
            ]
          },
          "name": "conv1d",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      10,
                      3
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "input_layer",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              10,
              32
            ]
          },
          "name": "batch_normalization",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      10,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "conv1d",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "pool_size": [
              2
            ],
            "padding": "valid",
            "strides": [
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "name": "max_pooling1d",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      10,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "batch_normalization",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "LSTM",
          "config": {
            "name": "lstm",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "zero_output_for_mask": false,
            "units": 32,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "recurrent_initializer": {
              "module": "keras.initializers",
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              5,
              32
            ]
          },
          "name": "lstm",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      5,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "max_pooling1d",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false,
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.3,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "name": "dropout",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "lstm",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "dense",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dropout",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 5,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          },
          "name": "dense_1",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      32
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        }
      ],
      "input_layers": [
        "input_layer",
        0,
        0
      ],
      "output_layers": [
        "dense_1",
        0,
        0
      ]
    },
    "keras_version": "3.13.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            32,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            32,
            5
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            5
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}